#  - Компонент- це ф-я, яка отримує об'єкт властивостей
#  (який називається props) і повертає React-елементи (HTML розмітку).

#     4 основних поняття в реакт:
#  1. компоненти (components) -синтаксис, 
#     завдяки якому створюються компоненти
#  2. JavaScript Syntax Extension
#  3. властивості (props)- управляти компонентами
#  4. стан (state)
===============================================================
способи створити компонент:

-функціональні компоненти -

традиційна ф-я:
 function HelloWorld() {
    retern <h1>Hello World</h1>
 }

або стрілочна:
const HelloWorld = () => {
    retern <h1>Hello World</h1>
} - перевага - змінна, оголошена в const не може мати інакше значення

-класові компоненти:
class HelloWorld extends Component {
    render() {
        return <h1>Hello World</h1>
    }
}
 Метод render визначає те, що належить рендерингу

 ==============================================================

 JSX -синтаксис, завдяки якому можна об'єднувати html, css i js.
